sand96/USB_Andriod_stm32f4XX/Firmware/USB_APP/src/usbd_cdc_core.c
  /*---------------------------------------------------------------------------*/
  
  /*Data class interface descriptor*/
  0x09,   /* bLength: Endpoint Descriptor size */
  USB_INTERFACE_DESCRIPTOR_TYPE,  /* bDescriptorType: */
  0x01,   /* bInterfaceNumber: Number of Interface */
  0x00,   /* bAlternateSetting: Alternate setting */
  0x02,   /* bNumEndpoints: Two endpoints used */
  0x0A,   /* bInterfaceClass: CDC */
  0x00,   /* bInterfaceSubClass: */
  0x00,   /* bInterfaceProtocol: */
  0x00,   /* iInterface: */
  
  /*Endpoint OUT Descriptor*/
  0x07,   /* bLength: Endpoint Descriptor size */
  USB_ENDPOINT_DESCRIPTOR_TYPE,      /* bDescriptorType: Endpoint */
  CDC_OUT_EP,                        /* bEndpointAddress */
  0x02,                              /* bmAttributes: Bulk */
  0x40,                              /* wMaxPacketSize: */
  0x00,
  0x00,                              /* bInterval: ignore for Bulk transfer */
  
  /*Endpoint IN Descriptor*/
  0x07,   /* bLength: Endpoint Descriptor size */
  USB_ENDPOINT_DESCRIPTOR_TYPE,     /* bDescriptorType: Endpoint */
  CDC_IN_EP,                        /* bEndpointAddress */
  0x02,                             /* bmAttributes: Bulk */
  0x40,                             /* wMaxPacketSize: */
  0x00,
  0x00                              /* bInterval */
};
#endif /* USE_USB_OTG_HS  */

/**
  * @}
  */ 

/** @defgroup usbd_cdc_Private_Functions
  * @{
  */ 

/**
  * @brief  usbd_cdc_Init
  *         Initialize the CDC interface
  * @param  pdev: device instance
  * @param  cfgidx: Configuration index
  * @retval status
  */
uint8_t  usbd_cdc_Init (void  *pdev, 
                               uint8_t cfgidx)
{
  uint8_t *pbuf;

  /* Open EP IN */
  DCD_EP_Open(pdev,
              CDC_IN_EP,
              CDC_DATA_IN_PACKET_SIZE,
              USB_OTG_EP_BULK);
  
  /* Open EP OUT */
  DCD_EP_Open(pdev,
              CDC_OUT_EP,
              CDC_DATA_OUT_PACKET_SIZE,
              USB_OTG_EP_BULK);
  
  /* Open Command IN EP */
  DCD_EP_Open(pdev,
              CDC_CMD_EP,
              CDC_CMD_PACKET_SZE,
              USB_OTG_EP_INT);
  
  pbuf = (uint8_t *)USBD_DeviceDesc;
  pbuf[4] = DEVICE_CLASS_CDC;
  pbuf[5] = DEVICE_SUBCLASS_CDC;
  
  /* Initialize the Interface physical components */
  APP_FOPS.pIf_Init();

  /* Prepare Out endpoint to receive next packet */
  DCD_EP_PrepareRx(pdev,
                   CDC_OUT_EP,
                   (uint8_t*)(USB_Rx_Buffer),
                   CDC_DATA_OUT_PACKET_SIZE);
  
  return USBD_OK;
}

/**
  * @brief  usbd_cdc_Init
  *         DeInitialize the CDC layer
  * @param  pdev: device instance
  * @param  cfgidx: Configuration index
  * @retval status
  */
uint8_t  usbd_cdc_DeInit (void  *pdev, 
                                 uint8_t cfgidx)
{
  /* Open EP IN */
  DCD_EP_Close(pdev,
              CDC_IN_EP);
  
  /* Open EP OUT */
  DCD_EP_Close(pdev,
              CDC_OUT_EP);
  
  /* Open Command IN EP */
  DCD_EP_Close(pdev,
              CDC_CMD_EP);

  /* Restore default state of the Interface physical components */
  APP_FOPS.pIf_DeInit();
  
  return USBD_OK;
}

/**
  * @brief  usbd_cdc_Setup
  *         Handle the CDC specific requests
  * @param  pdev: instance
  * @param  req: usb requests
  * @retval status
  */
uint8_t  usbd_cdc_Setup (void  *pdev, 
                                USB_SETUP_REQ *req)
{
  switch (req->bmRequest & USB_REQ_TYPE_MASK)
  {
    /* CDC Class Requests -------------------------------*/
  case USB_REQ_TYPE_CLASS :
      /* Check if the request is a data setup packet */
      if (req->wLength)
      {
        /* Check if the request is Device-to-Host */
        if (req->bmRequest & 0x80)
        {
          /* Get the data to be sent to Host from interface layer */
          APP_FOPS.pIf_Ctrl(req->bRequest, CmdBuff, req->wLength);
          
          /* Send the data to the host */
          USBD_CtlSendData (pdev, 
                            CmdBuff,
                            req->wLength);          
        }
        else /* Host-to-Device request */
        {
          /* Set the value of the current command to be processed */
          cdcCmd = req->bRequest;
          cdcLen = req->wLength;
          
          /* Prepare the reception of the buffer over EP0
          Next step: the received data will be managed in usbd_cdc_EP0_TxSent() 
          function. */
          USBD_CtlPrepareRx (pdev,
                             CmdBuff,
                             req->wLength);          
        }
      }
      else /* No Data request */
      {
        /* Transfer the command to the interface layer */
        APP_FOPS.pIf_Ctrl(req->bRequest, NULL, 0);
      }
      
      return USBD_OK;
      
    default:
      USBD_CtlError (pdev, req);
      return USBD_FAIL;
    
    /* Standard Requests -------------------------------*/
  case USB_REQ_TYPE_STANDARD:
    switch (req->bRequest)
    {
    case USB_REQ_GET_DESCRIPTOR: 
      USBD_CtlError (pdev, req);
      return USBD_FAIL;
      
    case USB_REQ_GET_INTERFACE :
      USBD_CtlSendData (pdev,
                        (uint8_t *)&usbd_cdc_AltSet,
                        1);
      break;
      
    case USB_REQ_SET_INTERFACE :
      if ((uint8_t)(req->wValue) < USBD_ITF_MAX_NUM)
      {
        usbd_cdc_AltSet = (uint8_t)(req->wValue);
      }
      else
      {
        /* Call the error management function (command will be nacked */
        USBD_CtlError (pdev, req);
      }
      break;
    }
  }
  return USBD_OK;
}

/**
  * @brief  usbd_cdc_EP0_RxReady
  *         Data received on control endpoint
  * @param  pdev: device instance
  * @retval status
  */
uint8_t  usbd_cdc_EP0_RxReady (void  *pdev)
{ 
  if (cdcCmd != NO_CMD)
  {
    /* Process the data */
    APP_FOPS.pIf_Ctrl(cdcCmd, CmdBuff, cdcLen);
    
    /* Reset the command variable to default value */
    cdcCmd = NO_CMD;
  }
  
  return USBD_OK;
}


/**
  * @brief  usbd_audio_DataIn
  *         Data sent on non-control IN endpoint
  * @param  pdev: device instance
  * @param  epnum: endpoint number
  * @retval status
  */
uint8_t  usbd_cdc_DataIn (void *pdev, uint8_t epnum)
{
 // uint16_t USB_Tx_ptr;
  uint16_t USB_Tx_length;
  
  u32 Len;
  u32 i;

  if (USB_Tx_State == USB_CDC_BUSY)
  {
    if (APP_Rx_length == 0) 
    {
      USB_Tx_State = USB_CDC_IDLE;
    }
    else 
    {
      if(APP_Rx_ptr_out > APP_Rx_ptr_in) /* first sitution */
      {
        APP_Rx_length = APP_RX_DATA_SIZE - APP_Rx_ptr_out;
        APP_Rx_length += APP_Rx_ptr_in;
        flag = 1; //show rollback happens
      }
      else /* No rollback happens*/
      {
        APP_Rx_length = APP_Rx_ptr_in - APP_Rx_ptr_out;
      }

        /*enough data to transfer*/
        /*Put all the data into a new array called TxBufTemp*/
      if(APP_Rx_length > CDC_DATA_IN_PACKET_SIZE)
      {
        if(flag == 1)
        {
          Len = APP_Rx_ptr_out + CDC_DATA_IN_PACKET_SIZE;
           /*if the Len is bigger than the app buffer*/
          if(Len > APP_RX_DATA_SIZE) // APP_RX_DATA_SIZE is 2048B
          {
            /*first part data*/
            for( i = 0; i < (APP_RX_DATA_SIZE - APP_Rx_ptr_out); i++)
              TxBufTemp[i] = APP_Rx_Buffer[APP_Rx_ptr_out + i];
            /*second part data*/
            for(i = 0 ; i <(Len - APP_RX_DATA_SIZE); i++ )
              TxBufTemp[APP_RX_DATA_SIZE - APP_Rx_ptr_out + i] = APP_Rx_Buffer[i];
            USB_Tx_length = CDC_DATA_IN_PACKET_SIZE;
            APP_Rx_ptr_out = CDC_DATA_IN_PACKET_SIZE + APP_Rx_ptr_out -APP_RX_DATA_SIZE;
            APP_Rx_length -= CDC_DATA_IN_PACKET_SIZE;
          }
          else /* Len < APP_RX_DATA_SIZE*/
          {
            for(i = 0; i < CDC_DATA_IN_PACKET_SIZE; i++)
              TxBufTemp[i] = APP_Rx_Buffer[APP_Rx_ptr_out + i];
            USB_Tx_length = CDC_DATA_IN_PACKET_SIZE;
            APP_Rx_ptr_out += CDC_DATA_IN_PACKET_SIZE;
            APP_Rx_length -= CDC_DATA_IN_PACKET_SIZE;
          }
        }
        else /*flag == 0*/
        {
          for(i = 0; i < CDC_DATA_IN_PACKET_SIZE; i++)
          TxBufTemp[i] = APP_Rx_Buffer[APP_Rx_ptr_out + i];
          USB_Tx_length = CDC_DATA_IN_PACKET_SIZE;
          APP_Rx_ptr_out += CDC_DATA_IN_PACKET_SIZE;
          APP_Rx_length -= CDC_DATA_IN_PACKET_SIZE;
        }
      }

      else /*APP_Rx_length < CDC_DATA_IN_PACKET_SIZE*/
      {
        if(flag == 1)
        {
          Len = APP_Rx_ptr_out + APP_Rx_length;
           /*if the Len is bigger than the app buffer*/
          if(Len > APP_RX_DATA_SIZE) // APP_RX_DATA_SIZE is 2048B
          {
            /*first part data*/
            for( i = 0; i < (APP_RX_DATA_SIZE - APP_Rx_ptr_out); i++)
              TxBufTemp[i] = APP_Rx_Buffer[APP_Rx_ptr_out + i];
            /*second part data*/
            for(i = 0 ; i <(APP_Rx_length + APP_Rx_ptr_out- APP_RX_DATA_SIZE); i++ )
              TxBufTemp[APP_RX_DATA_SIZE - APP_Rx_ptr_out + i] = APP_Rx_Buffer[i];
            USB_Tx_length = APP_Rx_length;
            APP_Rx_ptr_out = APP_Rx_length + APP_Rx_ptr_out -APP_RX_DATA_SIZE;
            APP_Rx_length = 0;
          }
          else /* Len < APP_RX_DATA_SIZE*/
          {
            for(i = 0; i < APP_Rx_length; i++)
            TxBufTemp[i] = APP_Rx_Buffer[APP_Rx_ptr_out + i];
            USB_Tx_length = APP_Rx_length;
            APP_Rx_ptr_out += APP_Rx_length;
            APP_Rx_length = 0;
          }
        }
        else /*flag == 0*/
        {
          for(i = 0; i < APP_Rx_length; i++)
          TxBufTemp[i] = APP_Rx_Buffer[APP_Rx_ptr_out + i];
          USB_Tx_length = APP_Rx_length;
          APP_Rx_ptr_out += APP_Rx_length;
          APP_Rx_length = 0;
        }
      }
      
      /* Prepare the available data buffer to be sent on IN endpoint */
      DCD_EP_Tx (pdev,
                 CDC_IN_EP,
                 TxBufTemp,
                 USB_Tx_length);
      return USBD_OK;
    }
  }  
  
