sand96/USB_Andriod_stm32f4XX/Firmware/USB_APP/src/usbd_cdc_core.c
  /* Avoid any asynchronous transfer during ZLP */
  if (USB_Tx_State == USB_CDC_ZLP)
  {
    /*Send ZLP to indicate the end of the current transfer */
    DCD_EP_Tx (pdev,
               CDC_IN_EP,
               NULL,
               0);
    
    USB_Tx_State = USB_CDC_IDLE;
  }
  return USBD_OK;
}

/**
  * @brief  usbd_cdc_DataOut
  *         Data received on non-control Out endpoint
  * @param  pdev: device instance
  * @param  epnum: endpoint number
  * @retval status
  */
uint8_t  usbd_cdc_DataOut (void *pdev, uint8_t epnum)
{      
  uint16_t USB_Rx_Cnt;
  
  /* Get the received data buffer and update the counter */
  USB_Rx_Cnt = ((USB_OTG_CORE_HANDLE*)pdev)->dev.out_ep[epnum].xfer_count;
  
  /* USB data will be immediately processed, this allow next USB traffic being 
  NAKed till the end of the application Xfer */
  APP_FOPS.pIf_DataRx(USB_Rx_Buffer, USB_Rx_Cnt);
  
  /* Prepare Out endpoint to receive next packet */
  DCD_EP_PrepareRx(pdev,
                   CDC_OUT_EP,
                   (uint8_t*)(USB_Rx_Buffer),
                   CDC_DATA_OUT_PACKET_SIZE);
  
  return USBD_OK;
}

/**
  * @brief  usbd_audio_SOF
  *         Start Of Frame event management
  * @param  pdev: instance
  * @param  epnum: endpoint number
  * @retval status
  */
uint8_t  usbd_cdc_SOF (void *pdev)
{      
  static uint32_t FrameCount = 0;
  
  if (FrameCount++ == CDC_IN_FRAME_INTERVAL)
  {
    /* Reset the frame counter */
    FrameCount = 0;
    
    /* Check the data to be sent through IN pipe */
    Handle_USBAsynchXfer(pdev);
  }
  
  return USBD_OK;
}

/**
  * @brief  Handle_USBAsynchXfer
  *         Send data to USB
  * @param  pdev: instance
  * @retval None
  */
static void Handle_USBAsynchXfer (void *pdev)
{
  //uint16_t USB_Tx_ptr;
  uint16_t USB_Tx_length;
  u32 i;
  u32 Len;

  if(USB_Tx_State != USB_CDC_BUSY)
  {
    if (APP_Rx_ptr_out == APP_RX_DATA_SIZE)
    {
      APP_Rx_ptr_out = 0;
    }
    
    if(APP_Rx_ptr_out == APP_Rx_ptr_in) 
    {
      USB_Tx_State = USB_CDC_IDLE; 
      return;
    }
    
    if(APP_Rx_ptr_out > APP_Rx_ptr_in) /* rollback */
    { 
      APP_Rx_length = APP_RX_DATA_SIZE - APP_Rx_ptr_out;
      APP_Rx_length += APP_Rx_ptr_in;
      flag = 1;
      
    }
    else 
    {
      APP_Rx_length = APP_Rx_ptr_in - APP_Rx_ptr_out;
      flag = 0; 
    }
    
#ifdef USB_OTG_HS_INTERNAL_DMA_ENABLED
    APP_Rx_length &= ~0x03;
#endif /* USB_OTG_HS_INTERNAL_DMA_ENABLED */
    
    if (APP_Rx_length > CDC_DATA_IN_PACKET_SIZE)
    {
			if(flag)
			{
				Len = APP_Rx_ptr_out + CDC_DATA_IN_PACKET_SIZE;
				if(Len > APP_RX_DATA_SIZE)
				{
					for(i = 0; i < (APP_RX_DATA_SIZE -APP_Rx_ptr_out); i++)
					TxBufTemp[i] = APP_Rx_Buffer[APP_Rx_ptr_out + i];
					for(i = 0; i < CDC_DATA_IN_PACKET_SIZE + APP_Rx_ptr_out - APP_RX_DATA_SIZE; i++)
					TxBufTemp[APP_RX_DATA_SIZE- APP_Rx_ptr_out + i] = APP_Rx_Buffer[i];
			      USB_Tx_length = CDC_DATA_IN_PACKET_SIZE; 
			      APP_Rx_ptr_out = CDC_DATA_IN_PACKET_SIZE + APP_Rx_ptr_out - APP_RX_DATA_SIZE;	
			      APP_Rx_length -= CDC_DATA_IN_PACKET_SIZE;
				}
				else
				{
					for(i = 0; i < CDC_DATA_IN_PACKET_SIZE; i++)
					TxBufTemp[i] = APP_Rx_Buffer[APP_Rx_ptr_out];
					USB_Tx_length = CDC_DATA_IN_PACKET_SIZE;
				    APP_Rx_ptr_out += CDC_DATA_IN_PACKET_SIZE;	
				    APP_Rx_length -= CDC_DATA_IN_PACKET_SIZE;
				}
			}
			else
			{
				for(i = 0; i < CDC_DATA_IN_PACKET_SIZE; i++)
				TxBufTemp[i] = APP_Rx_Buffer[APP_Rx_ptr_out];
				USB_Tx_length = CDC_DATA_IN_PACKET_SIZE;
			    APP_Rx_ptr_out += CDC_DATA_IN_PACKET_SIZE;	
			    APP_Rx_length -= CDC_DATA_IN_PACKET_SIZE;

			}
    }
    else
    {
    	if(flag)
    	{
    		Len = APP_Rx_ptr_out + APP_Rx_length;
    		if(Len > APP_RX_DATA_SIZE)
    		{
	    		for(i = 0; i < APP_RX_DATA_SIZE - APP_Rx_ptr_out ; i++)
	    			TxBufTemp[i] = APP_Rx_Buffer[APP_Rx_ptr_out + i];
	    		for(i = 0; i < APP_Rx_length + APP_Rx_ptr_out - APP_RX_DATA_SIZE; i++)
	    			TxBufTemp[i + APP_RX_DATA_SIZE - APP_Rx_ptr_out + i] = APP_Rx_Buffer[i];
	    		USB_Tx_length = APP_Rx_length;
	    		APP_Rx_ptr_out = APP_Rx_length + APP_Rx_ptr_out - APP_RX_DATA_SIZE;
	    		APP_Rx_length = 0;
    		}
    		else
    		{
    			for(i = 0; i < APP_Rx_length ; i ++)
    				TxBufTemp[i] = APP_Rx_Buffer[APP_Rx_ptr_out + i];
 	    		USB_Tx_length = APP_Rx_length;
	    		APP_Rx_ptr_out += APP_Rx_length;
	    		APP_Rx_length = 0;   			
    		}
    	}
    	else
    	{
			for(i = 0; i < APP_Rx_length ; i ++)
				TxBufTemp[i] = APP_Rx_Buffer[APP_Rx_ptr_out + i];
	    		USB_Tx_length = APP_Rx_length;
    		APP_Rx_ptr_out += APP_Rx_length;
    		APP_Rx_length = 0;     		
    	}
    }
    
    DCD_EP_Tx (pdev,
               CDC_IN_EP,
               TxBufTemp,
               USB_Tx_length);
  }  
}

/**
  * @brief  USBD_cdc_GetCfgDesc 
  *         Return configuration descriptor
  * @param  speed : current device speed
  * @param  length : pointer data length
  * @retval pointer to descriptor buffer
  */
static uint8_t  *USBD_cdc_GetCfgDesc (uint8_t speed, uint16_t *length)
{
  *length = sizeof (usbd_cdc_CfgDesc);
  return usbd_cdc_CfgDesc;
}

/**
  * @brief  USBD_cdc_GetCfgDesc 
  *         Return configuration descriptor
  * @param  speed : current device speed
  * @param  length : pointer data length
  * @retval pointer to descriptor buffer
  */
#ifdef USE_USB_OTG_HS 
static uint8_t  *USBD_cdc_GetOtherCfgDesc (uint8_t speed, uint16_t *length)
{
  *length = sizeof (usbd_cdc_OtherCfgDesc);
  return usbd_cdc_OtherCfgDesc;
}
#endif
/**
  * @}
  */ 

/**
  * @}
  */ 

/**
  * @}
  */ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
